#вариант 4
weights = {
    'A': 71.08,   # аланин
    'C': 103.15,  # цистеин
    'D': 115.09,  # аспарагиновая кислота
    'E': 129.12,  # глутаминовая кислота
    'F': 147.13,  # фенилаланин
    'G': 57.05,   # глицин
    'H': 137.14,  # гистидин
    'I': 113.16,  # изолейцин
    'K': 128.17,  # лизин
    'L': 113.16,  # лейцин
    'M': 131.19,  # метионин
    'N': 114.11,  # аспарагин
    'P': 97.12,   # пролин
    'Q': 128.13,  # глутамин
    'R': 156.19,  # аргинин
    'S': 87.08,   # серин
    'T': 101.11,  # треонин
    'V': 99.14,   # валин
    'W': 186.21,  # триптофан
    'Y': 163.18   # тирозин
}
p = input('Введите протеиновую последовательность: ')
if len(p) > 1000:
    print('Длина последовательности не должна превышать 1000 аминокислот')
else:
    def calc_weight(p):
        p_weight = sum(weights[aa] for aa in p)
        return p_weight
weight = calc_weight(p)
print(f"Вес строки P: {weight:.2f}")
